* Retrieving logs

#+CALL: shell(command="gcloud compute ssh k8s-apisnoop-2ba342b1-master-qjl9")
#+CALL: shell(command="sudo su -")

file:/gssh:k8s-apisnoop-2ba342b1-master-qjl9|sudo:k8s-apisnoop-2ba342b1-master-qjl9:/etc/kubernetes
k8s-apisnoop-2ba342b1-master-qjl9
k8s-apisnoop-2ba342b1-master-qjl9
Our [[file:/sudo:root@k8s-apisnoop-2ba342b1-master-qjl9:/etc/kubernetes/audit-webhook.yaml][audit-webhook.yaml]] is not being used because the [[file:/sudo:root@k8s-apisnoop-2ba342b1-master-qjl9:/etc/kubernetes/manifests/kube-apiserver.yaml::-%20kube-apiserver][apiserver manifest]] 
does not include --audit-* parameters:
Even though our [[file:/sudo:root@k8s-apisnoop-2ba342b1-master-qjl9:/var/lib/cloud/instance/scripts/scripts_per-instance_20-master.sh::auditPolicy:][cloud-init script]] adds auditPolicy to [[file:/sudo:root@k8s-apisnoop-2ba342b1-master-qjl9:/etc/kubernetes/kubeadm.conf::auditPolicy:][kubeadm.conf]]:

I verified that we are [[file:/sudo:root@k8s-apisnoop-2ba342b1-master-qjl9:/var/log/cloud-init-output.log::+%20chmod%20+x%20kubeadm][using our kubeadm]].

[[file:/sudo:root@k8s-apisnoop-2ba342b1-master-qjl9:/etc/systemd/system/kubelet.service.d/10-kubeadm.conf::%5BService%5D][/etc/systemd/system/kubelet.service.d/10-kubeadm.conf]]
doesn't have the config either

I bit at a loss.

[[elisp:(term-ansi-make-term%20"*master*"%20"/usr/local/bin/gssh"%20"/dev/null"%20"k8s-apisnoop-2ba342b1-master-qjl9"%20"--zone"%20"australia-southeast1-c")][Create *master* ssh session]]
[[elisp:(display-buffer%20"*master*")][Display *master*]]
[[elisp:(process-send-string%20(get-process%20"*master*")%20"sudo%20su%20-\n")][sudo su -]]

#+CALL: shell(buffer="*master*",command="docker ps -a")
#+CALL: shell(buffer="*master*",command="clear")

#+RESULTS:

#+CALL: shell(buffer="*master*",command="docker ps -a | grep kube-apiserver-amd64")


#+RESULTS:

* kubeadm-gce-tf

Shouts to danisla for his work on terraform-google-k8s-gce which we slightly modified to support audit-webhooks.

[[file:cluster.tf::module%20"k8s"%20{][cluster.tf]] uses a slight fork of https://github.com/ii/terraform-google-k8s-gce?ref=audit-webhook

#+CALL: shell(command="cd ~/src/apisnoop/dev/gce/")

#+RESULTS:

#+CALL: shell(command="terraform init")

#+RESULTS:

#+CALL: shell(command="terraform get -update")

#+RESULTS:

#+CALL: shell(command="terraform apply -auto-approve")

#+RESULTS:

Spawn an async buffer
#+CALL: process(command="terraform apply -auto-approve",buffer="*terraform apply*")

#+RESULTS:
: *terraform apply* terraform apply -auto-approve

#### DESTROY
#+CALL: process(command="terraform destroy -force",buffer="*terraform destroy*")

#+RESULTS:
: *terraform destroy* terraform destroy -force

#+CALL: shell(command="export KUBECONFIG=$PWD/kubeconfig")

#+RESULTS:

#+CALL: shell(command="kubectl apply -f ../elasticsearch/")

#+RESULTS:


#+CALL: shell(buffer="*elk*",command="export KUBECONFIG=$PWD/kubeconfig")

#+RESULTS:

#+NAME: instance-list
#+BEGIN_SRC shell :exports results :results value verbatim drawer replace :cache yes
gcloud compute instances list
#+END_SRC

#+RESULTS[d0eeb56920c12e84ee53c64a8d6f70e1025d7e3b]: instance-list
:RESULTS:
NAME                                       ZONE                    MACHINE_TYPE   PREEMPTIBLE  INTERNAL_IP  EXTERNAL_IP    STATUS
k8s-apisnoop-2ba342b1-default-pool-5mh4    australia-southeast1-a  n1-highmem-2                10.152.0.4   35.189.32.32   RUNNING
k8s-apisnoop-2ba342b1-default-pool-0ht9    australia-southeast1-b  n1-highmem-2                10.152.0.2   35.189.16.238  RUNNING
gke-apisnooper-default-pool-2e76210d-7npf  australia-southeast1-c  n1-standard-1               10.152.0.6   35.189.15.46   RUNNING
gke-apisnooper-default-pool-2e76210d-k4d2  australia-southeast1-c  n1-standard-1               10.152.0.7   35.189.33.164  RUNNING
gke-apisnooper-default-pool-2e76210d-wmn9  australia-southeast1-c  n1-standard-1               10.152.0.5   35.189.21.87   RUNNING
k8s-apisnoop-2ba342b1-default-pool-91pj    australia-southeast1-c  n1-highmem-2                10.152.0.3   35.189.15.251  RUNNING
k8s-apisnoop-2ba342b1-master-qjl9          australia-southeast1-c  n1-standard-4               10.152.0.10  35.189.32.73   RUNNING
:END:

#+NAME: master-node
#+BEGIN_SRC shell :exports results :results output table org drawer replace :cache no
gcloud compute instances list --filter="name~'.*master.*'" | tail -1 | awk '{print $1}'
#+END_SRC

#+RESULTS: master-node
: k8s-apisnoop-2ba342b1-master-qjl9

#+NAME: follow_master_cloud_init
#+HEADERS: :var masternode=master-node
#+BEGIN_SRC emacs-lisp :exports none :results none
  (start-process "master-ssh-cloudinit" "master-ssh-cloudinit"
   "gcloud" "compute" "ssh" masternode "--command"
   "tail -n +0 -f /var/log/cloud-init-output.log" "--" "-L" "6443:10.152.10:6443")
  (display-buffer "master-ssh-cloudinit")
#+END_SRC

#+RESULTS: follow_master_cloud_init
: #<window 85 on master-ssh-cloudinit>

#+NAME: apiserver-container
#+BEGIN_SRC shell :exports results :results output table org drawer replace :cache no
{
gcloud compute ssh masternode --command "sudo docker ps"
} 2>&1
# | grep kube-apiserver
#+END_SRC#+HEADERS: :var masternode=master-node

#+RESULTS: apiserver-container
:RESULTS:
:END:


:results output verbatim code

#+NAME: configure_kubectl
#+HEADERS: :var masternode=master-node
#+BEGIN_SRC shell :var masternode=master-node[1,0]
{
set -e -x
export KUBECONFIG=$PWD/kubeconfig
gcloud compute ssh $masternode --zone australia-southeast1-c \
  --command "sudo KUBECONFIG=/etc/kubernetes/admin.conf kubectl config view --flatten" \
  > $KUBECONFIG
kubectl config unset clusters.kubernetes.certificate-authority-data
kubectl config set clusters.kubernetes.insecure-skip-tls-verify true
kubectl config set clusters.kubernetes.server https://127.0.0.1:6443
} 2>&1
#+END_SRC

#+RESULTS: configure_kubectl
| +        | export                                                     | KUBECONFIG=/zfs/home/chris/src/apisnoop/dev/gce/kubeconfig |       |                                                |                        |                        |           |       |                                       |         |        |      |            |
| +        | KUBECONFIG=/zfs/home/chris/src/apisnoop/dev/gce/kubeconfig |                                                            |       |                                                |                        |                        |           |       |                                       |         |        |      |            |
| +        | gcloud                                                     | compute                                                    | ssh   | k8s-apisnoop-2ba342b1-master-qjl9              | --zone                 | australia-southeast1-c | --command | 'sudo | KUBECONFIG=/etc/kubernetes/admin.conf | kubectl | config | view | --flatten' |
| +        | kubectl                                                    | config                                                     | unset | clusters.kubernetes.certificate-authority-data |                        |                        |           |       |                                       |         |        |      |            |
| Property | clusters.kubernetes.certificate-authority-data             | unset.                                                     |       |                                                |                        |                        |           |       |                                       |         |        |      |            |
| +        | kubectl                                                    | config                                                     | set   | clusters.kubernetes.insecure-skip-tls-verify   | true                   |                        |           |       |                                       |         |        |      |            |
| Property | clusters.kubernetes.insecure-skip-tls-verify               | set.                                                       |       |                                                |                        |                        |           |       |                                       |         |        |      |            |
| +        | kubectl                                                    | config                                                     | set   | clusters.kubernetes.server                     | [[https://127.0.0.1:6443]] |                        |           |       |                                       |         |        |      |            |
| Property | clusters.kubernetes.server                                 | set.                                                       |       |                                                |                        |                        |           |       |                                       |         |        |      |            |

#+BEGIN_SRC emacs-lisp
  (setenv "KUBECONFIG" "/zfs/home/chris/src/apisnoop/dev/gce/kubeconfig")
  (setenv "SHELL" "/bin/bash")
#+END_SRC

#+RESULTS:
: /bin/bash

#+CALL: process(command="kubectl proxy -v=2",buffer="*kubectl-proxy*")

#+RESULTS:
: *kubectl-proxy* kubectl proxy -v=2

#+CALL: shell(command="kubectl get all --all-namespaces")

#+RESULTS:

If kubectl & proxy are working, the dashboard should also work:

http://127.0.0.1:8001/api/v1/namespaces/kube-system/services/kubernetes-dashboard/proxy/#!/namespace?namespace=_all

# kubeadm-config.yaml:
https://github.com/kubernetes/kubernetes/blob/master/cmd/kubeadm/app/apis/kubeadm/types.go#L30
# cloud-config.yaml :
https://github.com/kubernetes/kubernetes/blob/master/pkg/cloudprovider/providers/gce/gce.go#L101
https://kubernetes.io/docs/reference/feature-gates/

https://www.terraform.io/docs/providers/google/r/compute_instance.html
https://cloud.google.com/sdk/gcloud/reference/alpha/compute/instances/set-scopes#--scopes


#+NAME: Please give me an RBAC admin auth token
#+BEGIN_SRC shell
cat <<EOADMIN | kubectl apply -f -
apiVersion: v1
kind: ServiceAccount
metadata:
  name: draft-user
  namespace: kube-system
---
apiVersion: rbac.authorization.k8s.io/v1beta1
kind: ClusterRoleBinding
metadata:
  name: draft-user
roleRef:
  apiGroup: rbac.authorization.k8s.io
  kind: ClusterRole
  name: cluster-admin
subjects:
- kind: ServiceAccount
  name: draft-user
  namespace: kube-system
EOADMIN
kubectl -n kube-system describe secret $(kubectl -n kube-system get secret | grep draft-user | awk '{print $1}')
#+END_SRC

#+RESULTS: Please give me an RBAC admin auth token
| serviceaccount                                                         | ks-user                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | unchanged  |
| clusterrolebinding.rbac.authorization.k8s.io                           | ks-user                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | configured |
| Name:                                                                  | ks-user-token-tbv6t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |            |
| Namespace:                                                             | kube-system                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |            |
| Labels:                                                                | <none>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |            |
| Annotations:                                                           | kubernetes.io/service-account.name=ks-user                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |            |
| kubernetes.io/service-account.uid=04aa0237-4a9f-11e8-852a-42010a98000a |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |            |
|                                                                        |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |            |
| Type:                                                                  | kubernetes.io/service-account-token                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |            |
|                                                                        |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |            |
| Data                                                                   |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |            |
| ====                                                                   |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |            |
| ca.crt:                                                                | 1025                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     | bytes      |
| namespace:                                                             | 11                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       | bytes      |
| token:                                                                 | eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJrdWJlcm5ldGVzL3NlcnZpY2VhY2NvdW50Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9uYW1lc3BhY2UiOiJrdWJlLXN5c3RlbSIsImt1YmVybmV0ZXMuaW8vc2VydmljZWFjY291bnQvc2VjcmV0Lm5hbWUiOiJrcy11c2VyLXRva2VuLXRidjZ0Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9zZXJ2aWNlLWFjY291bnQubmFtZSI6ImtzLXVzZXIiLCJrdWJlcm5ldGVzLmlvL3NlcnZpY2VhY2NvdW50L3NlcnZpY2UtYWNjb3VudC51aWQiOiIwNGFhMDIzNy00YTlmLTExZTgtODUyYS00MjAxMGE5ODAwMGEiLCJzdWIiOiJzeXN0ZW06c2VydmljZWFjY291bnQ6a3ViZS1zeXN0ZW06a3MtdXNlciJ9.J_5BhNZcnLdmV5uOH0DI5dkgeUwN-70x5f0P3vmKoWuNutHVj9IYIsmW-CEq9jTTbJFccV5xF6lH3WMWyE-KhmIwAJe1q1DFdJfK__-VJy5VjGwCk8VFwcJxB7JEJatiP1gxGtgHysXBaatfO9_hPPxGdwCgSfv0Q_6nZZ5LsXbN-O92dH36s1g1B7siF4PAZJraRybW5f1bq9YATsKw4WnsdA6haQQyhV6n7fNqYkzQvxe_sgLuxxvA3PNksJSIFbtwuFmgN7VHHQ_gxxTdxmJJAIpQNNOfsWHBdUSdvdVcNXgEn7uBBdhOdm85wzO0M5K5QLj5FFO7kw600Z7aLA |            |

* Functions

#+NAME: process
#+HEADERS: :exports none :results silent :var buffer="OUTPUT"
#+BEGIN_SRC emacs-lisp :var command="echo"
;(lwarn 'bytecomp :warning (concat buffer " " command))
(start-process-shell-command buffer buffer command)
(message (concat buffer " " command))
;(concat "success" "yeah")
#+END_SRC

#+NAME: shell
#+HEADERS: :var buffer="*ansi-term*" :results output drawer silent
#+BEGIN_SRC emacs-lisp :var command
(process-send-string (get-process buffer) (concat command "\n"))
#+END_SRC

* Scratch
#+NAME: terraform apply
#+BEGIN_SRC shell :exports results :results value verbatim drawer replace :cache no
{
set +x
set +e
terraform init
terraform get -update
} 2>&1
:
#+END_SRC
tramp-gcloud
https://gist.github.com/scjody/287f8ca88d0055b7da9969357b762e7f


# Local Variables:
# eval: (org-babel-do-load-languages 'org-babel-load-languages '((go . t)(shell . t)))
# org-confirm-babel-evaluate: t
# aexplicit-shell-file-name: '/bin/bash'
# End:
* e2e tests for
** Draft
 ff  ff ff
